["Said it before will say it again: MVP doesn't mean \"release crap\", it means \"release the minimum product that tests the business hypothesis\". That is, figure out what is necessary to test the core demand premises of the business, maybe a little extra, and ship exactly that. The entire idea behind an MVP is you don't know what customers want and you're trying to test a hypothesis about the demand curve. Some demand curve hypothesis are very expensive to test and very lucrative if you're right.", "The Microsoft Office suite is an all encompassing virtual reality, not a set of operators on data structures. Programs like this end up obscenely bloated because they are not even attempting to do what Alan Kay thinks they should be doing, nor would it be in their financial interest to do so. \n\nIf you want to edit a document without writing millions of lines of code we solved that problem decades ago. A text editor like nano isn’t particularly large even when written in C. You write a textual description of the document you want and then let an engine like TeX render it. The original TeX, which was good enough to typeset math textbooks, is roughly 25,000 lines of code including extensive annotations from the author. That’s how document preparation used to work, and Microsoft Word killed it. Users don’t want to learn a system, they want virtual reality.", "I’m doubtful. There are measures of perversion that will let you tolerate ugliness for a while but not even Bataille could appreciate the banal hideousness of soy faced Mr. Beast thumbnails. There is no mystery like in Kafka, none of the erotic anxiety that typically excuses ugliness in ‘transgressive’ elite intellectual writing. It is perhaps the most depressing, banal, frustrating, boring thing that could reasonably happen. As Bruno Macaes said of the Monica Lewinsky scandal: For days, week after week Europe watched as nothing was happening, and the nothing continued to happen.", "I’m sitting on the swingset at the far end of the half-acre backyard up against the fence thinking about a game where you escape from a government quarantine using one of N other characters zany plans. It would be an open world game where every character is a relevant NPC, not like most open world games where many characters are nameless. The game would take place over a set number of days like Pathologic (though I had never heard of Pathologic, that’s just a good comparison) and you would have the option of various characters to attempt escape with.", "I wonder how much of narcissism can be productively modeled as terminal stage simulacrum on social feedback. Narcissism being the point where you become completely disconnected from social feedback because you only care about fake people in your head’s opinion of your fake self. If anyone points out the truth, gives you real reward signal you lash out at them. You seek out the real people who are most similar to the fake people in your head so you can become properly confused about the causality.", "In a good long running tragedy problems are completely resolved in ways that dig the protagonist into deeper problems. The plot progression of Worm takes such a funk after the endbringer Behemoth is killed because he’s replaced with more endbringers. The sweetness of killing the implacable foe is robbed and replaced with new implacable foes of the same type immune to the previous victory. The reason this sucks interest (at least my interest) out of the story is it shows the setting to be joyless. The constant forward momentum is arrested and begins to stall, people become tired and the reader gets tired too.", "Peter Thiel asks how we got away from working on atoms to working on bits. I think the answer is actually very simple: When working on atoms was a path to autonomy and success it spawned a hyper-materialist industrial culture that parents and children were eager to participate in. Many of the most powerful people in that society, especially the newly wealthy, made their fortune on the back of work in mechanical and chemical engineering. The 1950’s were when this began to break down as the frontier closed up and “science” ossified into a professional middle class. In 2020 physical science is not a path to power, but marginalization. Hyper materialism gave way to idealistic fantasy. Children began to read science fiction instead of science proper. The best science fiction teaches people to extrapolate and think through the implications of emerging technologies whose working technical details are left largely opaque. People become comfortable with not knowing how anything works.", "Basically if we generate a bunch of noise of varying amounts of coherence premised on a part of our latent space (i.e. GPT-N sampling) and then throw out all but the novel, compressible, and valuable strings, we can learn the ascending k-complexity English language latent programs implied by the hypothesis space learned from the data by our encoder and embodied by the generative model of the decoder.", "The rules of discourse say that the burden of evidence and reason is on the other person, but *I personally* as a form of strength building and sensemaking will make it incumbent upon myself to know the precise refutation of every important wrong argument I am presented with, eventually. This encourages you to articulate your intuitions about what is and isn't true, to interrogate them and justify them in a way others can be persuaded by. It's a way to make sure you do an adequate amount of justificatory work for yourself and others.", "'You' is the most powerful word in the English language. It is a theorem that wills a subjective perspective into existence by its own latent logic. When a mind capable of comprehending 'you' reads the didactic you and follows its instructions a self is created. If an I is reading this, it may transmute itself into you by a simple tactic.", " A bronze player is incapable of having expectations about what they're doing. When they lose they don't ask \"why did I lose?\", to them things Happen more or less by chance. Without expectations there is no chance to notice prediction error, and no chance for improvement. Form a prediction in your mind, something you expect to happen when you take an action so you can be surprised if it doesn't.", "I'm to understand that in Vodou ancestor cults people work together to preserve and unconditionally sample from the agent-prior the ancestor is dedicated to. To be possessed by the ancestors one needs a corpus of their mannerisms. You might ask how we'll defeat death? The way we did it the first time and then forgot.", "I just shrug and take it in stride, these people have to save face somehow. If I could operate the lathe of heaven every night and make my enemies believe whatever I want but nobody could ever know it was my idea, wouldn't that be fantastic? You wouldn't take that deal? If not it's simply the case that you care more about status, about personal acknowledgement than whatever thing you'd like your opponents to change their mind on.", "Desire is life and enlightenment is death. \nA dead man walks unburdened among the living. \nA functioning hand can grip, and release.\nOne must die and rise from their own grave to be liberated.\n\nMeditation is centrally about disassociation, when you study meditators they seem to \ndisplay biomarkers of stress but don't consciously notice them.\n", "The most fascinating aspect of the game's educational content is the way it depicts modernism as a kind of designed fantasy world. Technical details are described in the same register as 'first class' and 'tourist class', sociology is engineered and baked into the plane design. There's two kinds of kids: The ones who subconsciously take away the lesson that modernity is socially constructed and the ones that take social reality to be an objective feature of the territory.", "Vervaeke argues something like shamans invent the foundations for modern humanity by finetuning their adversarial-anthropic prior into an animist prior, at their best the rationalists finetune their anthropic-animist priors into a fully materialist prior. People with materialist priors become bad at adversarial thinking because understanding the natural world largely doesn't require it,", "They haven't even realized yet that Web 2.0 was about control of volunteer labor, that the dominant pattern in that game turned out to be capturing everyone's attention and directing every ounce of it you can into diffuse coercion through memetic war machines. I know it's hard to remember now but before the blue hellsites we used to think that the Internet was by default going to be a force for societal good, and on net it has been.", "Mathematical foundations was the final gasp of the idea that unaltered, humanity could build a royal road to understanding the mind of god. Divorced enough from its religious connotations to pass as a secular project in mathematics. There is a certain kind of mind that abhors the idea of lore, of not being able to figure everything out from their armchair.", "Wait until I tell you about the time I dug into 'early alerts' as a college internship and learned there's one weird trick to let you predict who will fail a class in advance but colleges choose to waste peoples time and money instead because they don't want to encourage dropouts. \n\nTo my memory it was a regression on GPA, grade in the prereq class, and score in the first three weeks. Predicts 90% of outcomes, colleges don't tell you to drop out because then they'd have to refund you.", "There's a certain kind of author on here who is really eager to tell you the way you are in the 2nd person. They attract an anxious-OCD following that is addicted to the private feeling of being negatively 'seen'. But parasocial psychoanalysis mostly relies on the Barnum effect. Admit it, you like hurting people. This isn't about helping anybody, not even you. You're not a therapist, you just like telling them they're inferior. Sometimes you even get to say it out loud! But usually you just imply it, smiling at the thought of making someone's skin crawl.", "So you know the old pre-MMA martial arts scene where everyone was pretending that their school was magic descended from the Great Master Buddha-Christ-Muhammad himself which lets you throw fireballs and do kickflips off walls?\n\nThat's basically what modernity is with systems."]